       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
      *********************************
      * AREA DE COMENTARIOS -- REMARKS
      * AUTHOR = LEONARDO LEOMONTAGNOLLI
      * OBJETIVO = Receber NOME E SALARIO E IMPRIMIR FORMATADO
      * - USO DA VIRGULA
      * UTILIZAR VARIAVEIS NIVEL 01, 02 ( ESTRUTUTADA)
      * DATA = 12/07/2020
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PICTURE X(20) VALUE SPACES.
       77 WRK-SALARIO PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
          ACCEPT WRK-NOME FROM CONSOLE.
          ACCEPT WRK-SALARIO FROM CONSOLE.

      *************** MOSTRA DADOS
         DISPLAY 'Nome: ' WRK-NOME.
         MOVE WRK-SALARIO TO WRK-SALARIO-ED.
         DISPLAY 'Salario: ' WRK-SALARIO-ED.
            STOP RUN.
