       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB05.
      *********************************
      * AREA DE COMENTARIOS -- REMARKS
      * AUTHOR = LEONARDO LEOMONTAGNOLLI
      * OBJETIVO = OPERADORES ARITIMETICOS
      * UTILIZAR VARIAVEIS NIVEL 01, 02 ( ESTRUTUTADA)
      * DATA = 12/07/2020
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-N1 PIC 9(02) VALUE ZEROS.
       77 WRK-N2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESU PIC 9(04) VALUE ZEROS.
       PROCEDURE DIVISION.
          ACCEPT WRK-N1 FROM CONSOLE.
          ACCEPT WRK-N2 FROM CONSOLE.

          DISPLAY 'N1: ' WRK-N1.
          DISPLAY 'N2: ' WRK-N2.
          ADD WRK-N1 WRK-N2 TO WRK-RESU

          DISPLAY 'Resultado: ' WRK-RESU.
          STOP RUN.
